case/CasTest/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       750;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       760;
    }
    Inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          40;
        startFace       770;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  Outlet;
    }
    Outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          40;
        startFace       810;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  Inlet;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       850;
    }
)

// ************************************************************************* //
