case/CasTest/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu nu [0 2 -1 0 0 0 0] 0.00001;
DC DC [0 2 -1 0 0 0 0] 0.001;
vst vst [0 1 -1 0 0 0 0] (0 0 0.01);
Cmax Cmax [0 0 0 0 0 0 0] 0.7;
rhog rhog [0 1 -2 0 0 0 0] (0 0 0.981);

// ************************************************************************* //
