case/CasTest/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (2 0 0)
    (2 0.0125 0)
    (0 0.0125 0)
    (0 0 1)
    (2 0 1)
    (2 0.0125 1)
    (0 0.0125 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 1 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    Inlet
    {
        type cyclic;
	neighbourPatch Outlet;
        faces
        (
            (0 4 7 3)
        );
    }

    Outlet
    {
        type cyclic;
	neighbourPatch Inlet;
        faces
        (
            (1 2 6 5)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);


// ************************************************************************* //
